# Пользователь вводит Имя, Возраст и Город, сформировать
# приветственное сообщение путем форматирования 3-мя способами
name=input('введите имя')
age=input('введите возраст ')
city=input('введите город')
text=('Меня зовут %s. Мне %s лет. Я из города %s.' % (name, age, city))
print(text)

# 2 способ

name=input('введите имя')
age=input('введите возраст ')
city=input('введите город')
text='Меня зовут {}. Мне {} лет. Я из города {}.'.format(name, age, city)
print(text)

# 3 способ

name=input('введите имя')
age=input('введите возраст ')
city=input('введите город')
print(f"Меня зовут {name}. Мне {age} лет. Я из города {city}.")