# Пользователь вводит 3 числа, сказать сколько из них положительных
# и сколько отрицательных

num1=int(input('введите число'))
num2=int(input('введите число'))
num3=int(input('введите число'))
print('количество положительных',(num1>0)+(num2>0)+(num3>0))
print('кол-во отрицательных',((num1<0)+(num2<0)+(num3<0)))